# int(정수)형 #

a = 5
b = -5
c = 0

print(type(a), type(b), type(c))
# 각타입은 모두 int형으로 출력 된다

########################################################################

# float(실수)형 = 부동소수점 #
d = 5.5
e = -5.5
f= 0.0
print(type(d), type(e), type(f))
# 각타입은 모두 float형으로 출력 된다

########################################################################

# 과학적 표기법 #

# 123456.7 = 1.234567 * 10^5 와 같이 표기 하고 싶다면
# 1.234567e5(=1.234567 * 10^5) 를하면 된다

g = 1.234567e5
print(g)

########################################################################

# complex 자료형 #
# 복소수와 복소수 연산들이 필요할때 사용하는 자료형
# 많이 사용하지는 않는 유형의 자료형
